/*
    I   итерация: односимвольные числа
        G ::= N'\0'
        N ::= ['0'-'9']         // пустые строчки разрешены ? Не помню

    II  итерация: многосимвольные числа
        G ::= N'\0'
        N :: ['0'-'9']+

    III итерация: сложение и вычитание
        G ::= E'\0'
        E ::= N{[+-]N}*
        N ::= ['0'-'9']+

    IV  итерация: умножение и деление с приоритетами, без скобок
        G ::= E'\0'     -- grammatic
        E ::= T{[+-]T}* -- expression
        T ::= N{[*\]N}* -- term
        N ::= ['0'-'9'] -- numeral


    V  итерация: умножение и деление со скобками
        G ::= E'\0'
        E ::= T{[+-]T}*
        T ::= P{[*\]P}*
        P ::= '('E')' | N
        N ::= ['0'-'9']+

        (2+5)*(2-5)'\0'
*/
